title: File Download Via Bitsadmin
id: 2ad0739a-d2de-41bd-9d59-f29562a39f55
description: Detects potential file downloads initiated through Bitsadmin.
status: test
author: jehuty (orig. lazarg)
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.t1197
  - attack.s0190
  - attack.t1036.003
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName|contains: 'bitsadmin.exe'
    CommandLine|contains: '/transfer DownloadJob'
condition: selection
falsepositives:
  - Unknown
level: medium
