title: Firewall Listening Notification Disabled via Netsh
id: e244e2f7-81a2-44b9-84a8-94e9ed8168a2
description: This rule alerts when netsh is used to disable firewall
  notifications for applications listening for inbound connections.
status: test
author: jehuty (orig. DetectionStream Training)
references:
- https://attack.mitre.org/techniques/T1562/004/
tags:
- attack.defense_evasion
- attack.T1562.004
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    OriginalFileName|endswith: 'netsh.exe'
    CommandLine|contains:
      - 'advfirewall set'
      - 'inboundusernotification disable'
  condition: selection
falsepositives:
  - Unknown
level: medium
